/* eslint-disable */
/* jshint esversion: 6 */
/* 
界面-图例
*/
export default {
  // !每个文件形成独立命名空间
  namespaced: true,
  // !初始值
  state: {
    // !图例颜色分布
    colors : [
      // 1雷达组合反射率
      [
        "#AA24FA",
        "#D48EFE",
        "#EE0230",
        "#FE645C",
        "#FEACAC",
        "#8C8C00",
        "#C8C802",
        "#FCF464",
        "#10921A",
        "#00EA00",
        "#A6FCA8",
        "#1E26D0",
        "#7A72EE",
        "#C0C0FE",
        "#00ACA4"
      ],
      // 2雷达QPE
      [
        "#FFFFFF",
        "#AE0000",
        "#FF0000",
        "#FFAA00",
        "#FFFF00",
        "#320096",
        "#0000FF",
        "#AF327D",
        "#FF00FF",
        "#008F00",
        "#00FF00",
        "#00AFAF",
        "#00FFFF",
        "#767676",
        "#9C9C9C"
      ],
      // 3自然色
      [
        "#3ecdbe",
        "#dcc8c8",
        "#2ae3d2",
        "#000000",
        "#2e4915",
        "#917150"
      ],
      // 4雾 雪
      [
        "#9aa3aa",
        "#dcc878",
        "#d2f6e0",
        "#ff7d4b",
        "#809857",
        "#033c56"
      ],
      // 5白天微物理特征
      [
        "#f52e6f",
        "#cd9623",
        "#b4c2a1",
        "#509628",
        "#011bb7",
        "#e6fa64",
        "#e61400",
        "#d8a29e"
      ],
      // 6沙尘
      [
        "#ff60ca",
        "#820000",
        "#a06e32",
        "#898200",
        "#7b80e9",
        "#c064a5",
        "#75a100",
        "#15143c"
      ],
      // 7强风暴
      [
        "#ffffff",
        "#000000",
        "#cac643"
      ],
      // 8气团
      [
        "#ffffff",
        "#f0bea0",
        "#494673",
        "#83080c",
        "#3a087e",
        "#1b7220",
        "#727200"
      ],
      // 9火山灰
      [
        "#624404",
        "#89923b",
        "#0f0a04",
        "#57ffbc",
        "#e60903"
      ],
      // 10对流云
      [
        "#ffffff",
        "#7c7cea",
        "#c8ca81",
        "#cac643",
        "#3d3d3d",
        "#15143c"
      ],
      // 11夜间物理特征
      [
        "#820000",
        "#15143c",
        "#a3feee",
        "#2e00fe",
        "#ccccff",
        "#bb8840",
        "#c064a5",
        "#790a03",
        "#94ee6e"
      ],
      // 12白天对流风暴
      [
        "#e1260e",
        "#ffff64",
        "#aa285a",
        "#aa3caf",
        "#3c00aa",
        "#5606ff"
      ],
      // 13风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 14风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 15风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 16风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 17风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 18风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 19风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ],
      // 20风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "#6C04F4",
        "#4703F7",
        "#0401FE",
        "#00A7CE",
        "#56F476",
        "#EBE90C",
        "#E85827",
        "#CE1834",
        "#B32124"
      ]
    ],
    // !图例对应文字
    grades : [
      // 1雷达组合反射率
      [
        "70",
        "65",
        "60",
        "55",
        "50",
        "45",
        "40",
        "35",
        "30",
        "25",
        "20",
        "70",
        "10",
        "5",
        "0"
      ],
      // 2雷达QPE
      [
        "2030",
        "1300",
        "1000",
        "900",
        "800",
        "700",
        "600",
        "500",
        "400",
        "300",
        "250",
        "200",
        "150",
        "100",
        "50"
      ],
      // 3自然色
      [
        "高冰云",
        "低水云",
        "雪",
        "海洋",
        "植被",
        "裸地"
      ],
      // 4雾 雪
      [
        "大冰粒深积云",
        "小冰粒深积云",
        "低云/雾",
        "雪",
        "陆地",
        "海洋"
      ],
      // 5白天微物理特征
      [
        "雪",
        "上升积雨云",
        "雾",
        "薄卷云",
        "海洋",
        "过冷厚水云",
        "深积云",
        "暖水云"
      ],
      // 6沙尘
      [
        "沙尘",
        "高层云(冷厚)",
        "中层云(厚)",
        "中层云(薄)",
        "海洋",
        "陆地",
        "高纬度低云",
        "卷云"
      ],
      // 7强风暴
      [
        "积雨云",
        "卷云",
        "强上升积雨云"
      ],
      // 8气团
      [
        "厚高层云",
        "厚中层云",
        "高纬度厚低云",
        "高空急流",
        "冷气团",
        "高温度暖气团",
        "低湿度暖气团"
      ],
      // 9火山灰
      [
        "冷厚高层云",
        "厚中层云",
        "薄卷云尾迹",
        "火山SO2云",
        "火山灰"
      ],
      // 10对流云
      [
        "积雨云",
        "卷云",
        "高积云",
        "低中云/雾/雪",
        "陆地",
        "海洋"
      ],
      // 11夜间物理特征
      [
        "冷厚高层云",
        "卷云",
        "雾",
        "海洋",
        "暖低云",
        "厚中层云",
        "陆地",
        "过冷高层云",
        "冷低云"
      ],
      // 12白天对流风暴
      [
        "深对流层云",
        "上升积雨云",
        "大冰粒卷云",
        "小冰粒卷云",
        "海洋",
        "陆地"
      ],
      // 13风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 14风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 15风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 16风云四号探测仪 2D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 17风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 18风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 19风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
      // 20风云四号探测仪 3D 大气温度垂直探测 从小到大
      [
        "190",
        "210",
        "230",
        "250",
        "270",
        "290",
        "310",
        "330",
        "330"
      ],
    ],
    // !图例标题
    legendTitle: [
      // 0
      "雷达组合反射率",
      // 1
      "雷达降水估计",
      // 2
      "自然色",
      // 3
      "雾/积雪",
      // 4
      "白天微物理特征",
      // 5
      "沙尘",
      // 6
      "强风暴",
      // 7
      "气团",
      // 8
      "火山灰",
      // 9
      "对流云",
      // 10
      "夜间物理特征",
      // 11
      "白天对流风暴",
      // 12
      "大气温度垂直探测500hPa(k)",
      // 13
      "大气温度垂直探测700hPa(k)",
      // 14
      "大气温度垂直探测850hPa(k)",
      // 15
      "大气温度垂直探测1000hPa(k)",
      // 16
      "大气大气温度垂直探测 3D",
      // 17
      "大气大气温度垂直探测 3D",
      // 18
      "大气大气温度垂直探测 3D",
      // 19
      "大气大气温度垂直探测 3D"
    ]
  },
  // !执行事件 同步
  mutations: {
  },
  // !执行时间 异步
};
